In [29]:
import pandas as pd
import numpy as np

In [18]:
s1 = pd.Series(np.arange(5), index = ['A','B','C','D','E'])
s1

A    0
B    1
C    2
D    3
E    4
dtype: int32

In [19]:
s2 = s1[:3]
s2

A    0
B    1
C    2
dtype: int32

In [20]:
s2['A'] = 1234
s2

A    1234
B       1
C       2
dtype: int32

In [21]:
s1

A    1234
B       1
C       2
D       3
E       4
dtype: int32

In [24]:
s1['A']

1234

In [23]:
s1[['A','B','C']]

A    1234
B       1
C       2
dtype: int32

In [28]:
s1[(s1>2) & (s1<5)] = 10
s1

A    10
B     1
C     2
D    10
E    10
dtype: int32

In [31]:
df1 = pd.DataFrame(np.random.randn(4,5), index = ['r1','r2','r3','r4'], columns = ['c1','c2','c3','c4','c5'])
df1

          c1        c2        c3        c4        c5
r1 -0.894626 -1.652743  1.353868  1.389440 -0.011817
r2 -0.519217 -1.525206 -1.100178  1.318465 -0.941568
r3 -1.192283  0.689119 -0.546413  1.483261 -0.480758
r4 -0.221098  1.106347  0.421400  0.281128  1.173512

In [32]:
df1['c1']

r1   -0.894626
r2   -0.519217
r3   -1.192283
r4   -0.221098
Name: c1, dtype: float64

In [35]:
df1[['c1','c2','c3']]

          c1        c2        c3
r1 -0.894626 -1.652743  1.353868
r2 -0.519217 -1.525206 -1.100178
r3 -1.192283  0.689119 -0.546413
r4 -0.221098  1.106347  0.421400

In [36]:
# 选取c2大于0的行
df1[df1['c2']>0]

          c1        c2        c3        c4        c5
r3 -1.192283  0.689119 -0.546413  1.483261 -0.480758
r4 -0.221098  1.106347  0.421400  0.281128  1.173512

In [38]:
df1.iloc[1]

c1   -0.519217
c2   -1.525206
c3   -1.100178
c4    1.318465
c5   -0.941568
Name: r2, dtype: float64

In [39]:
df1.loc['r2']

c1   -0.519217
c2   -1.525206
c3   -1.100178
c4    1.318465
c5   -0.941568
Name: r2, dtype: float64

In [40]:
df1.iloc[[0,2,3],[1,2]]

          c2        c3
r1 -1.652743  1.353868
r3  0.689119 -0.546413
r4  1.106347  0.421400

In [45]:
df2 = df1.copy()
df2['c6'] = ['one','tow','three','four']
print(df1)
df2

          c1        c2        c3        c4        c5
r1 -0.894626 -1.652743  1.353868  1.389440 -0.011817
r2 -0.519217 -1.525206 -1.100178  1.318465 -0.941568
r3 -1.192283  0.689119 -0.546413  1.483261 -0.480758
r4 -0.221098  1.106347  0.421400  0.281128  1.173512

          c1        c2        c3        c4        c5     c6
r1 -0.894626 -1.652743  1.353868  1.389440 -0.011817    one
r2 -0.519217 -1.525206 -1.100178  1.318465 -0.941568    tow
r3 -1.192283  0.689119 -0.546413  1.483261 -0.480758  three
r4 -0.221098  1.106347  0.421400  0.281128  1.173512   four

In [48]:
df2[df2['c6'].isin(['three','four'])]

          c1        c2        c3        c4        c5     c6
r3 -1.192283  0.689119 -0.546413  1.483261 -0.480758  three
r4 -0.221098  1.106347  0.421400  0.281128  1.173512   four